AIbiplayer/Stm32/BalanceCar/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define HC_SR04_Echo_Pin GPIO_PIN_13
#define HC_SR04_Echo_GPIO_Port GPIOC
#define HC_SR04_Echo_EXTI_IRQn EXTI15_10_IRQn
#define MPU_SCL_Pin GPIO_PIN_14
#define MPU_SCL_GPIO_Port GPIOC
#define MPU_SDA_Pin GPIO_PIN_15
#define MPU_SDA_GPIO_Port GPIOC
#define PWMA_Pin GPIO_PIN_0
#define PWMA_GPIO_Port GPIOA
#define PWMB_Pin GPIO_PIN_1
#define PWMB_GPIO_Port GPIOA
#define HC_SR04_Trig_Pin GPIO_PIN_3
#define HC_SR04_Trig_GPIO_Port GPIOA
#define AIN1_Pin GPIO_PIN_4
#define AIN1_GPIO_Port GPIOA
#define AIN2_Pin GPIO_PIN_5
#define AIN2_GPIO_Port GPIOA
#define E1_A_Pin GPIO_PIN_6
#define E1_A_GPIO_Port GPIOA
#define E1_B_Pin GPIO_PIN_7
#define E1_B_GPIO_Port GPIOA
#define OLED_SDA_Pin GPIO_PIN_0
#define OLED_SDA_GPIO_Port GPIOB
#define OLED_SCL_Pin GPIO_PIN_1
#define OLED_SCL_GPIO_Port GPIOB
#define BlueTooth_TX_Pin GPIO_PIN_10
#define BlueTooth_TX_GPIO_Port GPIOB
#define BlueTooth_RX_Pin GPIO_PIN_11
#define BlueTooth_RX_GPIO_Port GPIOB
#define STBY_Pin GPIO_PIN_12
#define STBY_GPIO_Port GPIOA
#define BIN2_Pin GPIO_PIN_3
#define BIN2_GPIO_Port GPIOB
#define BIN1_Pin GPIO_PIN_4
#define BIN1_GPIO_Port GPIOB
#define E2_A_Pin GPIO_PIN_6
#define E2_A_GPIO_Port GPIOB
#define E2_B_Pin GPIO_PIN_7
#define E2_B_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
